renesas/iot-reference-rx/Projects/test_aws_ether_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_s12ad_rx/src/r_s12ad_rx.c
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Show driver as closed */
    g_dcb.opened = false;

    return ADC_SUCCESS;

#endif /* #if (definedBSP_MCU_RX64M || definedBSP_MCU_RX65_ALL || definedBSP_MCU_RX66T \
    || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72M)    || defined(BSP_MCU_RX72T) \
    || defined(BSP_MCU_RX231) || defined(BSP_MCU_RX230)    || defined(BSP_MCU_RX23W) \
    || defined(BSP_MCU_RX130) || defined(BSP_MCU_RX13T)    || defined(BSP_MCU_RX66N) \
    || defined(BSP_MCU_RX72N) || defined(BSP_MCU_RX23E_A)  || defined(BSP_MCU_RX23E_B) \
    || defined(BSP_MCU_RX23T) || defined(BSP_MCU_RX24T)    || defined(BSP_MCU_RX24U) \
    || defined(BSP_MCU_RX671) || defined(BSP_MCU_RX140)    || defined(BSP_MCU_RX660) \
    || defined(BSP_MCU_RX26T) || defined(BSP_MCU_RX260)    || defined(BSP_MCU_RX261)) */
} /* End of function R_ADC_Close() */


/**********************************************************************************************************************
* Function Name: R_ADC_GetVersion
 ******************************************************************************************************************//**
 * @brief This function returns the driver version number at runtime.
 * @retval Version number.
 * @details Returns the version of this module. The version number is encoded such that the top 2 bytes are the major
 * version number and the bottom 2 bytes are the minor version number.
 * @note None.
 */
uint32_t  R_ADC_GetVersion(void)
{
    uint32_t const version = (ADC_VERSION_MAJOR << 16) | ADC_VERSION_MINOR;

    return version;
} /* End of function R_ADC_GetVersion() */


#if (!defined(BSP_MCU_RX64M) && !defined(BSP_MCU_RX65_ALL) && !defined(BSP_MCU_RX66T) \
    && !defined(BSP_MCU_RX71M) && !defined(BSP_MCU_RX72T) && !defined(BSP_MCU_RX72M) \
    && !defined(BSP_MCU_RX13T) && !defined(BSP_MCU_RX66N) && !defined(BSP_MCU_RX72N) \
    && !defined(BSP_MCU_RX23T) && !defined(BSP_MCU_RX24T) && !defined(BSP_MCU_RX24U) \
    && !defined(BSP_MCU_RX671) && !defined(BSP_MCU_RX660) && !defined(BSP_MCU_RX26T))

/******************************************************************************
* Function Name: adc_enable_s12adi0
* Description  : This function clears the S12ADI0 interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : none
* Return Value : none
*******************************************************************************/
void adc_enable_s12adi0(void)
{

    IR(S12AD,S12ADI0) = 0;                  // clear flag
    S12AD.ADCSR.BIT.ADIE = 1;               // enable in peripheral
    if (0 != ICU.IPR[IPR_S12AD_S12ADI0].BYTE)
    {
        R_BSP_InterruptRequestEnable(VECT(S12AD,S12ADI0));             // enable in ICU
    }
} /* End of function adc_enable_s12adi0() */


/*****************************************************************************
* Function Name: adc_s12adi0_isr
* Description  : Interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12adi0_isr(void)
{
    adc_cb_evt_t    event = ADC_EVT_SCAN_COMPLETE;

    /* presence of callback function verified in Open() */
    if ((NULL != g_dcb.p_callback) && (FIT_NO_FUNC != g_dcb.p_callback))
    {
        g_dcb.p_callback(&event);
    }
} /* End of function adc_s12adi0_isr() */

/*****************************************************************************
* Function Name: adc_gbadi_isr
* Description  : Interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_gbadi_isr(void)
{
    adc_cb_evt_t    event = ADC_EVT_SCAN_COMPLETE_GROUPB;

    /* presence of callback function verified in Open() */
    if ((NULL != g_dcb.p_callback) && (FIT_NO_FUNC != g_dcb.p_callback))
    {
        g_dcb.p_callback(&event);
    }
} /* End of function adc_gbadi_isr() */

#endif /* #if (!definedBSP_MCU_RX64M && !definedBSP_MCU_RX65_ALL && !definedBSP_MCU_RX66T \
    && !definedBSP_MCU_RX71M && !definedBSP_MCU_RX72T && !definedBSP_MCU_RX72M \
    && !definedBSP_MCU_RX13T && !definedBSP_MCU_RX66N && !definedBSP_MCU_RX72N \
    && !definedBSP_MCU_RX23T && !definedBSP_MCU_RX24T && !definedBSP_MCU_RX24U \
    && !definedBSP_MCU_RX671 && !definedBSP_MCU_RX660 && !definedBSP_MCU_RX26T */
